app/views/devise/registrations/edit.html.erb

            <%= f.label 'Moved chapter?' %> <br>
            <%= grouped_collection_select(:user, :chapter_id, Country.all, :chapters, :name, :id, :city, prompt: 'Please choose a chapter') %>
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."country_id" = $1  [["country_id", 1]]
SELECT "countries".* FROM "countries"