app/views/devise/registrations/new.html.erb

SELECT "chapters".* FROM "chapters" WHERE "chapters"."country_id" = $1  [["country_id", 1]]
SELECT "countries".* FROM "countries"
---
              <%= f.label 'Please select from your nearest chapter' %> <br>
              <%= grouped_collection_select(:user, :chapter_id, Country.all, :chapters, :name, :id, :city, prompt: 'Please choose a chapter') %>