app/views/projects/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                </td>
                <td><%= project.user.first_name %> <%= project.user.last_name %></td>