app/views/projects/show.html.erb


        <h1><%= @project.title %> <small>by <%= @project.user.first_name %> <%= @project.user.last_name %></small></h1>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]