app/controllers/projects_controller.rb

  def index
    @projects = Project.all
    @user = User.find(params[:user_id])
---
SELECT "projects".* FROM "projects"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @project = Project.new
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @project = Project.new(project_params)
    @project.user = current_user
    @user = User.find(params[:user_id])

    respond_to do |format|
      if @project.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "projects" ("intro", "impact", "businesscase", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["intro", "ghj"], ["impact", "ghjk"], ["businesscase", "ghjk"], ["user_id", 1], ["created_at", "2018-06-27 13:22:23.538989"], ["updated_at", "2018-06-27 13:22:23.538989"]]

  def destroy
    @user = User.find(params[:user_id])

    @project.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]