app/controllers/resources_controller.rb

SELECT "resources".* FROM "resources"
---
  def index
    @resources = Resource.all